VoodooChild99/perry/synthesizer/example/SAM4L-EK/ATSAM4LC4C.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HFLASHC</name>
      <version>1.1.0</version>
      <description>Flash Controller</description>
      <groupName>FLASHCALW</groupName>
      <prependToName>FLASHCALW_</prependToName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HFLASHC</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>FCMD</name>
          <description>Flash Controller Command Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NOP</name>
                  <description>No Operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP</name>
                  <description>Write Page</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP</name>
                  <description>Erase Page</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPB</name>
                  <description>Clear Page Buffer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Lock Region containing page</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Unlock Region containing page</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EA</name>
                  <description>Erase All, including secuity and fuse bits</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WGPB</name>
                  <description>Write General-Purpose fuse Bit</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EGPB</name>
                  <description>Erase General-Purpose fuse Bit</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSB</name>
                  <description>Set Security Bit</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGPFB</name>
                  <description>Program GPFuse Byte</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EAGPF</name>
                  <description>Erase All GP Fuses</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QPR</name>
                  <description>Quick Page Read</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUP</name>
                  <description>Write User Page</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUP</name>
                  <description>Erase User Page</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QPRUP</name>
                  <description>Quick Page Read User Page</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSEN</name>
                  <description>High Speed Mode Enable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSDIS</name>
                  <description>High Speed Mode Disable</description>
                  <value>0x11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAGEN</name>
              <description>Page number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Write protection key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>KEY</name>
                  <value>0xa5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>Flash Controller Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Flash Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FRDYSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Flash Ready does not generate an interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Flash Ready generates an interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKE</name>
              <description>Lock Error Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LOCKESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Lock Error does not generate an interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Lock Error generates an interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROGE</name>
              <description>Programming Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PROGESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Programming Error does not generate an interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Programming Error generates an interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWS</name>
              <description>Flash Wait State</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FWSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The flash is read with 0 wait states</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The flash is read with 1 wait states</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WS1OPT</name>
              <description>Wait State 1 Optimization</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGPFRHI</name>
          <description>Flash Controller General Purpose Fuse Register High</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPF32</name>
              <description>General Purpose Fuse 32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF33</name>
              <description>General Purpose Fuse 33</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF34</name>
              <description>General Purpose Fuse 34</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF35</name>
              <description>General Purpose Fuse 35</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF36</name>
              <description>General Purpose Fuse 36</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF37</name>
              <description>General Purpose Fuse 37</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF38</name>
              <description>General Purpose Fuse 38</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF39</name>
              <description>General Purpose Fuse 39</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF40</name>
              <description>General Purpose Fuse 40</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF41</name>
              <description>General Purpose Fuse 41</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF42</name>
              <description>General Purpose Fuse 42</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF43</name>
              <description>General Purpose Fuse 43</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF44</name>
              <description>General Purpose Fuse 44</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF45</name>
              <description>General Purpose Fuse 45</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF46</name>
              <description>General Purpose Fuse 46</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF47</name>
              <description>General Purpose Fuse 47</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF48</name>
              <description>General Purpose Fuse 48</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF49</name>
              <description>General Purpose Fuse 49</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF50</name>
              <description>General Purpose Fuse 50</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF51</name>
              <description>General Purpose Fuse 51</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF52</name>
              <description>General Purpose Fuse 52</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF53</name>
              <description>General Purpose Fuse 53</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF54</name>
              <description>General Purpose Fuse 54</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF55</name>
              <description>General Purpose Fuse 55</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF56</name>
              <description>General Purpose Fuse 56</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF57</name>
              <description>General Purpose Fuse 57</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF58</name>
              <description>General Purpose Fuse 58</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF59</name>
              <description>General Purpose Fuse 59</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF60</name>
              <description>General Purpose Fuse 60</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF61</name>
              <description>General Purpose Fuse 61</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF62</name>
              <description>General Purpose Fuse 62</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPF63</name>
              <description>General Purpose Fuse 63</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
