VoodooChild99/perry/synthesizer/example/SAM4L-EK/ATSAM4LC4C.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>CMR%s</name>
          <description>Channel Mode Register Channel</description>
          <alternateGroup>WAVEFORM</alternateGroup>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TCCLKS</name>
              <description>Clock Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>TCCLKSSelect</name>
                <enumeratedValue>
                  <name>TIMER_DIV1_CLOCK</name>
                  <description>TIMER_DIV1_CLOCK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_DIV2_CLOCK</name>
                  <description>TIMER_DIV2_CLOCK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_DIV3_CLOCK</name>
                  <description>TIMER_DIV3_CLOCK</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_DIV4_CLOCK</name>
                  <description>TIMER_DIV4_CLOCK</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_DIV5_CLOCK</name>
                  <description>TIMER_DIV5_CLOCK</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC0</name>
                  <description>XC0</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC1</name>
                  <description>XC1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC2</name>
                  <description>XC2</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKI</name>
              <description>Clock Invert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CLKISelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter is incremented on rising edge of the clock.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter is incremented on falling edge of the clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURST</name>
              <description>Burst Signal Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BURSTSelect</name>
                <enumeratedValue>
                  <name>NOT_GATED</name>
                  <description>The clock is not gated by an external signal.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_AND_XC0</name>
                  <description>XC0 is ANDed with the selected clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_AND_XC1</name>
                  <description>XC1 is ANDed with the selected clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_AND_XC2</name>
                  <description>XC2 is ANDed with the selected clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPCSTOP</name>
              <description>Counter Clock Stopped with RC Compare</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPCSTOPSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clock is not stopped when counter reaches RC.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clock is stopped when counter reaches RC.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPCDIS</name>
              <description>Counter Clock Disable with RC Compare</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPCDISSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clock is not disabled when counter reaches RC.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clock is disabled when counter reaches RC.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EEVTEDG</name>
              <description>External Event Edge Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EEVTEDGSelect</name>
                <enumeratedValue>
                  <name>NO_EDGE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS_EDGE</name>
                  <description>rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG_EDGE</name>
                  <description>falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH_EDGES</name>
                  <description>each edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EEVT</name>
              <description>External Event Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EEVTSelect</name>
                <enumeratedValue>
                  <name>TIOB_INPUT</name>
                  <description>TIOB input. If TIOB is chosen as the external event signal, it is configured as an input and no longer generates waveforms.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC0_OUTPUT</name>
                  <description>XC0 output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC1_OUTPUT</name>
                  <description>XC1 output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC2_OUTPUT</name>
                  <description>XC2 output</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENETRG</name>
              <description>External Event Trigger Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ENETRGSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The external event has no effect on the counter and its clock. In this case, the selected external event only controls the TIOA output.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The external event resets the counter and starts the counter clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAVSEL</name>
              <description>Waveform Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WAVSELSelect</name>
                <enumeratedValue>
                  <name>UP_NO_AUTO</name>
                  <description>UP mode without automatic trigger on RC Compare</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDOWN_NO_AUTO</name>
                  <description>UPDOWN mode without automatic trigger on RC Compare</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP_AUTO</name>
                  <description>UP mode with automatic trigger on RC Compare</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDOWN_AUTO</name>
                  <description>UPDOWN mode with automatic trigger on RC Compare</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAVE</name>
              <description>WAVE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WAVESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Waveform Mode is disabled (Capture Mode is enabled).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Waveform Mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACPA</name>
              <description>RA Compare Effect on TIOA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACPASelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>set</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>clear</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>toggle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACPC</name>
              <description>RC Compare Effect on TIOA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACPCSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>set</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>clear</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>toggle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AEEVT</name>
              <description>External Event Effect on TIOA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>AEEVTSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>set</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>clear</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>toggle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASWTRG</name>
              <description>Software Trigger Effect on TIOA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ASWTRGSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>set</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>clear</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>toggle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCPB</name>
              <description>RB Compare Effect on TIOB</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BCPBSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>set</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>clear</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>toggle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCPC</name>
              <description>RC Compare Effect on TIOB</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BCPCSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>set</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>clear</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>toggle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEEVT</name>
              <description>External Event Effect on TIOB</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BEEVTSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>set</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>clear</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>toggle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSWTRG</name>
              <description>Software Trigger Effect on TIOB</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BSWTRGSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>none</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>set</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>clear</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>toggle</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>CV%s</name>
          <description>Counter Value Channel</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CV</name>
              <description>Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FEATURES</name>
          <description>Features Register</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTRSIZE</name>
              <description>Counter Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>UPDNIMPL</name>
              <description>Up Down is Implemented</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRPBHSB</name>
              <description>Bridge Type is PB to HSB</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
